0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 288.5;

boundaryField
{
    frontAndBack
    {
        type        empty;
    }

     top
    {
          type            zeroGradient;
    }
 
     Bottom
    {
         type            zeroGradient;       
    }

   cold
    {
        type            fixedValue;
        value           uniform 298.5;
    }

    hot
    {
        type            fixedValue;
        value           uniform 288.5;  
    }
}


// ************************************************************************* //
